---
kind: type
id: T:Autodesk.Revit.DB.RenderDuration
source: html/26445fcb-caf7-8cfd-6b5b-74f71e0db936.htm
---
# Autodesk.Revit.DB.RenderDuration

An enumerated type containing possible duration types to do Raytracer render.

## Syntax (C#)
```csharp
public enum RenderDuration
```